# GetServiceTypeName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetServiceTypeName Method
FabricationConfiguration Class See Also
---
Gets the service type name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public string GetServiceTypeName(
	int serviceTypeId
)
```

Visual Basic
---
```text
Public Function GetServiceTypeName ( _
	serviceTypeId As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetServiceTypeName(
	int serviceTypeId
)
```

# ### Parameters
serviceTypeId
    Type: System..::..Int32 The service type identifier.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace